src/main/resources/templates/Authentification.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:saml2="urn:oasis:names:tc:SAML:2.0:assertion" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Header>
    <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
      <wsse:BinarySecurityToken EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" wsu:Id="X509-0B45B67E9DDC61562B13575648125861">INF_CERT_AS_BASE64</wsse:BinarySecurityToken>
      <wsu:Timestamp wsu:Id="TS-1">
        <wsu:Created>INF_NOT_BEFORE</wsu:Created>
        <wsu:Expires>INF_NOT_AFTER</wsu:Expires>
      </wsu:Timestamp>
      <ds:Signature Id="SIG-1" xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
        <ds:SignedInfo>
          <ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
            <ec:InclusiveNamespaces PrefixList="saml2 soapenv" xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" />
          </ds:CanonicalizationMethod>
          <ds:SignatureMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#rsa-sha256" />
          <ds:Reference URI="#TS-1">
            <ds:Transforms>
              <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
                <ec:InclusiveNamespaces PrefixList="wsse saml2 soapenv" xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#"/>
              </ds:Transform>
            </ds:Transforms>
            <ds:DigestMethod Algorithm="http://www.w3.org/2001/04/xmlenc#sha256" />
            <ds:DigestValue>INF_TIMESTAMP_TAG_DIGEST</ds:DigestValue>
          </ds:Reference>
          <ds:Reference URI="#X509-0B45B67E9DDC61562B13575648125861">
            <ds:Transforms>
              <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
                <ec:InclusiveNamespaces	PrefixList="" xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" />
              </ds:Transform>
            </ds:Transforms>
            <ds:DigestMethod Algorithm="http://www.w3.org/2001/04/xmlenc#sha256" />
            <ds:DigestValue>INF_CERTIFICATE_DIGEST</ds:DigestValue>
          </ds:Reference>
          <ds:Reference URI="#id-1">
            <ds:Transforms>
              <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
                <ec:InclusiveNamespaces PrefixList="saml2" xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" />
              </ds:Transform>
            </ds:Transforms>
            <ds:DigestMethod Algorithm="http://www.w3.org/2001/04/xmlenc#sha256" />
            <ds:DigestValue>INF_AUTHNREQUEST_DIGEST</ds:DigestValue>
          </ds:Reference>
        </ds:SignedInfo>
        <ds:SignatureValue>INF_SIGNATURE</ds:SignatureValue>
        <ds:KeyInfo Id="KI-1">
          <wsse:SecurityTokenReference wsu:Id="STR-1">
            <wsse:Reference URI="#X509-0B45B67E9DDC61562B13575648125861" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3"/>
          </wsse:SecurityTokenReference>
        </ds:KeyInfo>
      </ds:Signature>
    </wsse:Security>
  </soapenv:Header>
  <soapenv:Body wsu:Id="id-1" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
      <saml2p:AuthnRequest xmlns:saml2p="urn:oasis:names:tc:SAML:2.0:protocol" AssertionConsumerServiceURL="TEMPLATE_VAR_Authentification_AssertionConsumerServiceURL" Destination="TEMPLATE_VAR_Authentification_Destination" ID="TEMPLATE_VAR_Authentification_AuthnID" IssueInstant="TEMPLATE_VAR_Authentification_IssueInstant" ProtocolBinding="urn:oasis:names:tc:SAML:2.0:bindings:SOAP" Version="2.0">
           <saml2:Issuer>TEMPLATE_VAR_Authentification_Issuer</saml2:Issuer>
           <saml2p:Extensions>
               <saml2:Attribute Name="psEHealthID" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:unspecified">
                   <saml2:AttributeValue>TEMPLATE_VAR_Authentification_psEHealthID</saml2:AttributeValue>
               </saml2:Attribute>
           </saml2p:Extensions>
           <saml2:Subject>
             <saml2:SubjectConfirmation Method="urn:oasis:names:tc:SAML:2.0:cm:bearer"></saml2:SubjectConfirmation>/>
           </saml2:Subject>
           <saml2p:RequestedAuthnContext Comparison="minimum">
               <saml2:AuthnContextClassRef>urn:oasis:names:tc:SAML:2.0:ac:classes:X509</saml2:AuthnContextClassRef>
           </saml2p:RequestedAuthnContext>
      </saml2p:AuthnRequest>
  </soapenv:Body>
</soapenv:Envelope>
